# Introduction to Pandas

Pandas is a high level fata manipulation package which was built on top of Numpy. The key structures within pandas include Series and Dataframes

## Series

A series is a one-dimensional array with axis labels. A series is a ndarray, thus it is homogeneous and cannot store multiple dtypes.

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
x = pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
x.values

array([10, 20, 30, 40, 50])

In [8]:
x.dtype

dtype('int64')

In [11]:
# Creating series with an index

data = [450, 650, 870]
sales = Series(data, index=["Don", "Mike", "Edwin"])

In [12]:
sales

Don      450
Mike     650
Edwin    870
dtype: int64

In [13]:
type(sales)

pandas.core.series.Series

In [14]:
sales.index

Index(['Don', 'Mike', 'Edwin'], dtype='object')

## Accessing Values

In [17]:
sales["Don"]

np.int64(450)

In [18]:
sales[0]

C:\Users\vidus\AppData\Local\Temp\ipykernel_20412\1101347017.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales[0]

np.int64(450)

In [20]:
sales.iloc[0]

np.int64(450)

## Checking for conditions

In [21]:
sales > 500

Don      False
Mike      True
Edwin     True
dtype: bool

In [22]:
sales[[False, True, True]]

Mike     650
Edwin    870
dtype: int64

In [23]:
sales[sales>500]

Mike     650
Edwin    870
dtype: int64

In [25]:
"Sally" in sales

False

In [27]:
450 in sales
# 450 is not an index, it is a value. Hence this ouputs False

False

### Working with Dictionaries

In [29]:
# Converting series to dictionary

sales_dict = sales.to_dict()

In [30]:
sales_dict

{'Don': 450, 'Mike': 650, 'Edwin': 870}

In [31]:
# Converting dictionary to series
sales_ser = Series(sales_dict)
sales_ser

Don      450
Mike     650
Edwin    870
dtype: int64

### Adding enties and working with NaN/null values

In [35]:
# If indesx doesn't already have value, it is set to NaN by default
new_sales = Series(sales, index=["Don", "Mike", "Sally", "Edwin", "Lucy"])

In [36]:
new_sales

Don      450.0
Mike     650.0
Sally      NaN
Edwin    870.0
Lucy       NaN
dtype: float64

In [37]:
np.isnan(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

In [38]:
# To check for null values use pandas
pd.isnull(new_sales)

Don      False
Mike     False
Sally     True
Edwin    False
Lucy      True
dtype: bool

### Naming Components in a Series

In [40]:
sales.index.name = "Sales Person"

In [41]:
sales

Sales Person
Don      450
Mike     650
Edwin    870
dtype: int64

In [42]:
# NMaming a series
sales.name = "Total Sales"
sales

Sales Person
Don      450
Mike     650
Edwin    870
Name: Total Sales, dtype: int64

## DataFrames

DataFrames are two-dimensional, size-mutable, potentially heterogeneous tabular data structures. This data structure contains TWO labeled axes (row and column)

### Creating a DataFrame

In [44]:
# From list
data = [["Adrian", 20], ["Bethany", 23], ["Chloe", 41]]

df = pd.DataFrame(data, columns=["Name", "Age"])

In [45]:
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

### Pandas DataFrame Research Task

#### Creating a DataFrame from a dictionary

In [60]:
data_dict = {"row1" : ["Adrian", 20], "row2" : ["Bethany", 23], "row3": ["Chloe", 41]}

In [61]:
# orient arguement in the from_dict function can be used to set dictionary keys as rows or columns
# columns arguement can be used to set custom columns

df_dict = pd.DataFrame.from_dict(data_dict, orient="index", columns=["Person", "Number"])

In [62]:
df_dict

       Person  Number
row1   Adrian      20
row2  Bethany      23
row3    Chloe      41

#### Creating a DataFrame from a list of dictionaries

In [52]:
# pd.DataFrame(dict_list) can also be used
data_dict_list = [{'Person': 'Adrian', 'Age': 20}, 
        {'Person': "Bethany", 'Age': 23}]

df_list_dict = pd.DataFrame.from_records(data_dict_list)

In [65]:
df_list_dict

    Person  Age
0   Adrian   20
1  Bethany   23

#### Creating DataFrame from a Series

In [2]:
person_list = ["A", "B", "C"]
age_list = [20, 23, 21]

person_series = pd.Series(person_list)
age_series = pd.Series(age_list)

In [3]:
# To convert series to dataframe, it must be added to a disctiory and then converted to dataframe
column_dict = {"Person" : person_series, "Age" : age_series}
series_df = pd.DataFrame(column_dict)

In [4]:
series_df

  Person  Age
0      A   20
1      B   23
2      C   21

#### Adding a series to existing DataFrame

In [6]:
city_list = ["London", "New York", "London"]
city_series = pd.Series(city_list)

In [7]:
series_df['City'] = city_series

In [8]:
series_df

  Person  Age      City
0      A   20    London
1      B   23  New York
2      C   21    London

#### Changing index of a DataFrame

In [53]:
# set_index() can be used to change index of a DataFrame
# inplace arguement needs to be set true for change to be permenant
# reindex() method can also be used

series_df.set_index('Person')

NameError: name 'series_df' is not defined

#### Filling missing values

fillna() function can be used to fill missing values

In [ ]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", np.nan],
    "Age": [25, np.nan, 30, 35, 40],
    "City": ["New York", "Los Angeles", np.nan, "Chicago", "Houston"],
    "Salary": [50000, 60000, 70000, np.nan, 90000],
}

df = pd.DataFrame(data)

In [11]:
df.fillna("NaN Filler")

         Name         Age         City      Salary
0       Alice        25.0     New York     50000.0
1         Bob  NaN Filler  Los Angeles     60000.0
2     Charlie        30.0   NaN Filler     70000.0
3       David        35.0      Chicago  NaN Filler
4  NaN Filler        40.0      Houston     90000.0

method arguement can be given the value pad or bfill to perform a forward fill or backward fill. Forward fill fills the missing value with a previous value and backward fill fills the missing value with the next value. <br>
Note: This is an old method and is ideal to use seperate functions called ffill() and bfill() for these operations.

In [12]:
df.fillna(method='pad')

C:\Users\vidus\AppData\Local\Temp\ipykernel_31956\196241153.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob  25.0  Los Angeles  60000.0
2  Charlie  30.0  Los Angeles  70000.0
3    David  35.0      Chicago  70000.0
4    David  40.0      Houston  90000.0

In [13]:
df.ffill()

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob  25.0  Los Angeles  60000.0
2  Charlie  30.0  Los Angeles  70000.0
3    David  35.0      Chicago  70000.0
4    David  40.0      Houston  90000.0

#### Interpolate Function

#### Drop Values

drop() function can be used to drop columns or indexes from a DataFrame

| Operation | Function and Parameters |
| --------- | ----------------------- |
| Drop Rows | ```df.drop(index, axis=0)``` |
| Drop Columns | ```df.drop(columns, axis=1)``` |
| Drop rows/columns with NaN | ```df.dropna(axis=0/1)``` |
| Drop based on threshold | ```df.dropna(thresh=n)``` |
| Drop specific rows by index | ```df.drop([index1, index2], axis=0)``` |
| Drop specific columns | ```df.drop([column name], axis=1)``` |

In [2]:
drop_data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "City": ["New York", "Los Angeles", "Chicago", "Houston"]
}

In [6]:
df_drop = pd.DataFrame(drop_data)
df_drop

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [4]:
column_drop = df_drop.drop('City', axis = 1)

In [5]:
column_drop

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

In [10]:
data_missing = {
    "Name": ["Alice", "Bob", "Charlie", "David", np.nan],
    "Age": [25, np.nan, 30, 35, 40],
    "City": ["New York", "Los Angeles", np.nan, "Chicago", "Houston"],
    "Salary": [50000, 60000, np.nan, np.nan, 90000],
}

missing_df = pd.DataFrame(data_missing)
missing_df

      Name   Age         City   Salary
0    Alice  25.0     New York  50000.0
1      Bob   NaN  Los Angeles  60000.0
2  Charlie  30.0          NaN      NaN
3    David  35.0      Chicago      NaN
4      NaN  40.0      Houston  90000.0

In [11]:
drop_missing = missing_df.dropna()
drop_missing

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0

In [12]:
# thresh parameter says ho many no NaN values the row must contain for it to be not dropped
drop_thresh = missing_df.dropna(thresh=3)
drop_thresh

    Name   Age         City   Salary
0  Alice  25.0     New York  50000.0
1    Bob   NaN  Los Angeles  60000.0
3  David  35.0      Chicago      NaN
4    NaN  40.0      Houston  90000.0

In [14]:
drop_index = df_drop.drop([0,2], axis=0)
drop_index

    Name  Age         City
1    Bob   30  Los Angeles
3  David   40      Houston

#### Remove Duplicates

In [16]:
data_duplicates = {
    "Name": ["Alice", "Bob", "Alice", "David", "Bob"],
    "Age": [25, 30, 25, 40, 30],
    "City": ["New York", "Los Angeles", "New York", "Houston", "Los Angeles"]
}
df_duplicates = pd.DataFrame(data_duplicates)
df_duplicates

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
2  Alice   25     New York
3  David   40      Houston
4    Bob   30  Los Angeles

In [18]:
drop_duplicates = df_duplicates.drop_duplicates()
drop_duplicates

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
3  David   40      Houston

#### Select Values in a DataFrame

In [19]:
# There are multiple ways to select items in a DataFrame
# to select specific columns bracket notation or dot notation can be used

data_select = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "City": ["New York", "Los Angeles", "Chicago", "Houston"]
}

df_select = pd.DataFrame(data_select)

In [20]:
column_select_1 = df_select['Name']
column_select_1

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [21]:
column_select_2 = df_select.Name
column_select_2

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [23]:
# Multiple columns can be selected, result would be a dataframe whereas when single column is selected result is a series
multi_column_select = df_select[['Name', 'City']]
multi_column_select

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

In [26]:
# Columns can also be selected using loc and iloc functions.
# iloc uses index to locate the column

loc_select = df_select.loc[:, 'Age']
loc_select

0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [29]:
# index 1 to select second column which is age
iloc_select = df_select.iloc[:, 1]
iloc_select

0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [31]:
# Specific values can be specifying rows and columns
loc_select_specific = df_select.loc[1, 'Name']
loc_select_specific

'Bob'

#### Sorting Values

In [33]:
# Data Alignment
# sort_values() method can be used to sort dataframe by values

data_sort = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, 40],
    "Salary": [50000, 70000, 60000, 80000]
}

df_sort = pd.DataFrame(data_sort)
df_sort

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   70000
2  Charlie   35   60000
3    David   40   80000

In [35]:
# sort_values() has parameter ascending which is set to true by default. This can be set to false for descending order.
salary_sort = df_sort.sort_values('Salary')
salary_sort

      Name  Age  Salary
0    Alice   25   50000
2  Charlie   35   60000
1      Bob   30   70000
3    David   40   80000

In [37]:
# sorting can be done by multiple values
# In this case dataframe will be sorted by first value first and then the second value

multi_sort = df_sort.sort_values(['Salary', 'Age'])
multi_sort

      Name  Age  Salary
0    Alice   25   50000
2  Charlie   35   60000
1      Bob   30   70000
3    David   40   80000

In [38]:
# DataFrames can also be sorted by index

index_sort = multi_sort.sort_index()
index_sort

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   70000
2  Charlie   35   60000
3    David   40   80000

#### Ranking in DataFrane

In [40]:
#rank() can be used to assign ranks in a database
data_rank = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "Score": [90, 80, 90, 70, 80, 60]  
}

df_rank = pd.DataFrame(data_rank)
df_rank

      Name  Score
0    Alice     90
1      Bob     80
2  Charlie     90
3    David     70
4      Eve     80
5    Frank     60

In [49]:
# 90 is ranked 1st and 2nd, avg (1+2)/2 = 1.5
# 80 is ranked 3rd and 4th, avg (3+4)/2 = 3.5
df_rank["Rank_Average"] = df_rank["Score"].rank(method="average", ascending=False)
df_rank
df_rank.drop('Rank_Min', axis=1)

      Name  Score  Rank_Average
0    Alice     90           1.5
1      Bob     80           3.5
2  Charlie     90           1.5
3    David     70           5.0
4      Eve     80           3.5
5    Frank     60           6.0

In [50]:
df_rank["Rank_Min"] = df_rank["Score"].rank(method="min", ascending=False)
df_rank

      Name  Score  Rank_Average  Rank_Min
0    Alice     90           1.5       1.0
1      Bob     80           3.5       3.0
2  Charlie     90           1.5       1.0
3    David     70           5.0       5.0
4      Eve     80           3.5       3.0
5    Frank     60           6.0       6.0

In [51]:
# When first method is used, ranks are assigned in the order the data appears
df_rank["Rank_First"] = df_rank["Score"].rank(method="first", ascending=False)
df_rank

      Name  Score  Rank_Average  Rank_Min  Rank_First
0    Alice     90           1.5       1.0         1.0
1      Bob     80           3.5       3.0         3.0
2  Charlie     90           1.5       1.0         2.0
3    David     70           5.0       5.0         5.0
4      Eve     80           3.5       3.0         4.0
5    Frank     60           6.0       6.0         6.0

## Data Handling and Visualisation

In [2]:
import seaborn as sb
import matplotlib.pyplot as plt

In [4]:
iris = sb.load_dataset("iris")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [5]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [6]:
spec = iris.groupby('species')
spec.describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [10]:
spec.head()

     sepal_length  sepal_width  petal_length  petal_width     species
0             5.1          3.5           1.4          0.2      setosa
1             4.9          3.0           1.4          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
3             4.6          3.1           1.5          0.2      setosa
4             5.0          3.6           1.4          0.2      setosa
50            7.0          3.2           4.7          1.4  versicolor
51            6.4          3.2           4.5          1.5  versicolor
52            6.9          3.1           4.9          1.5  versicolor
53            5.5          2.3           4.0          1.3  versicolor
54            6.5          2.8           4.6          1.5  versicolor
100           6.3          3.3           6.0          2.5   virginica
101           5.8          2.7           5.1          1.9   virginica
102           7.1          3.0           5.9          2.1   virginica
103           6.3          2.9           5.6          1.8   virginica
104           6.5          3.0           5.8          2.2   virginica

In [14]:
iris2 = iris.set_index('species')
iris2

           sepal_length  sepal_width  petal_length  petal_width
species
setosa              5.1          3.5           1.4          0.2
setosa              4.9          3.0           1.4          0.2
setosa              4.7          3.2           1.3          0.2
setosa              4.6          3.1           1.5          0.2
setosa              5.0          3.6           1.4          0.2
...                 ...          ...           ...          ...
virginica           6.7          3.0           5.2          2.3
virginica           6.3          2.5           5.0          1.9
virginica           6.5          3.0           5.2          2.0
virginica           6.2          3.4           5.4          2.3
virginica           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [19]:
setosa_df = iris[iris.species == 'setosa']
versicolor_df = iris[iris.species == 'versicolor']
virginica_df = iris[iris.species == 'virginica']

In [24]:
sepal_df = iris.loc[:, ['sepal_length', 'sepal_width', 'species']]
sepal_df
# setosa_df = spec.get_group('setosa')

     sepal_length  sepal_width    species
0             5.1          3.5     setosa
1             4.9          3.0     setosa
2             4.7          3.2     setosa
3             4.6          3.1     setosa
4             5.0          3.6     setosa
..            ...          ...        ...
145           6.7          3.0  virginica
146           6.3          2.5  virginica
147           6.5          3.0  virginica
148           6.2          3.4  virginica
149           5.9          3.0  virginica

[150 rows x 3 columns]

In [25]:
petal_df = iris.loc[:, ['petal_length', 'petal_width', 'species']]
petal_df

     petal_length  petal_width    species
0             1.4          0.2     setosa
1             1.4          0.2     setosa
2             1.3          0.2     setosa
3             1.5          0.2     setosa
4             1.4          0.2     setosa
..            ...          ...        ...
145           5.2          2.3  virginica
146           5.0          1.9  virginica
147           5.2          2.0  virginica
148           5.4          2.3  virginica
149           5.1          1.8  virginica

[150 rows x 3 columns]